# DATA CLEANING #

**1) Removing NaN values***

In [17]:
import pandas as pd 

df = pd.read_csv('A2Z_insurance.csv')
df.head(3)

,Customer Identity,First Policy´s Year,Brithday Year,Educational Degree,Gross Monthly Salary,Geographic Living Area,Has Children (Y=1),Customer Monetary Value,Claims Rate,Premiums in LOB: Motor,Premiums in LOB: Household,Premiums in LOB: Health,Premiums in LOB: Life,Premiums in LOB: Work Compensations
0,1,1985.0,1982.0,2 - High School,2177.0,1.0,1.0,380.97,0.39,375.85,79.45,146.36,47.01,16.89
1,2,1981.0,1995.0,2 - High School,677.0,4.0,1.0,-131.13,1.12,77.46,416.20,116.69,194.48,106.13
2,3,1991.0,1970.0,1 - Basic,2277.0,3.0,0.0,504.67,0.28,206.15,224.50,124.58,86.35,99.02

In [18]:
#Age Columns
df['Age'] = 2016 - df['Brithday Year']
df['Client Age'] = 2016 - df['First Policy´s Year']

In [19]:
#df[df['Age'] <= 18.0]

In [20]:
#df[df['First Policy´s Year'] < df['Brithday Year']]

In [21]:
#Removing the guy from the future and the one with 965y.

print(df[df['Brithday Year'] == 1028.0].index) #Index 7197
print(df[df['First Policy´s Year'] == 53784].index) #Index 9294

df = df.drop([df.index[7195], df.index[9294]])

Int64Index([7195], dtype='int64')
Int64Index([9294], dtype='int64')

In [22]:
#Replacing the NaN values of Living Area column with the mode.

mode_geo = df['Geographic Living Area'].mode()
print(mode_geo)

df['Geographic Living Area'] = df['Geographic Living Area'].fillna(4.0)

df['Geographic Living Area'].isnull().sum()

0    4.0
dtype: float64

0

In [23]:
df_edu = df[['Educational Degree', 'Gross Monthly Salary']]
#df_edu

df_not_nan = df_edu[df_edu.notna().any(axis = 1)]

df_notNA_grouped = df_not_nan.groupby(['Educational Degree'])['Gross Monthly Salary'].mean()
df_notNA_grouped

Educational Degree
1 - Basic          1981.905213
2 - High School    2512.059395
3 - BSc/MSc        2616.703370
4 - PhD            2664.512195
Name: Gross Monthly Salary, dtype: float64

In [24]:
#Replacing the NaN values of Educational Degree column based on the mean of gross salary of which level of education.

df.loc[896,'Educational Degree'] = '3 - BSc/MSc'

df.loc[1707,'Educational Degree'] = '4 - PhD'

df.loc[2449,'Educational Degree'] = '4 - PhD'

df.loc[2728,'Educational Degree'] = '4 - PhD'

df.loc[2770,'Educational Degree'] = '1 - Basic'

df.loc[3056,'Educational Degree'] = '2 - High School'

df.loc[4423,'Educational Degree'] = '4 - PhD'

df.loc[6535,'Educational Degree'] = '2 - High School'

df.loc[7321,'Educational Degree'] = '4 - PhD'

df.loc[7470,'Educational Degree'] = '4 - PhD'

df.loc[8081,'Educational Degree'] = '4 - PhD'

df.loc[8173,'Educational Degree'] = '4 - PhD'

df.loc[8303,'Educational Degree'] = '4 - PhD'

df.loc[9136,'Educational Degree'] = '1 - Basic'

df.loc[9136,'Educational Degree'] = '1 - Basic'

df.loc[9312,'Educational Degree'] = '2 - High School'

df.loc[9610,'Educational Degree'] = '4 - PhD'

df['Educational Degree'].isnull().sum()

1